package ch2.Ex16_오버로딩;

/*
    자바에서는 메서드 이름이 같아도 매개변수의 개수나 타입이 다르면 다른 메서드로 본다.
    이 방식을 이용해서 한 클래스 내에 같은 이름을 가진 여러개의 메서드를 정의할 수 있는데 이걸 '오버로딩' 이라고 한다.

    - 오버로딩 장점
    비슷한 기능을 하는 메서드가 여러개라면 일일이 이름을 다 기억해야 하지만, 하나의 이름으로 통일하면 하나의 이름만 기억하면 되기 때문에
    기억하기 쉽고 이름도 짧게 할 수 있어서 오류의 가능성을 줄일 수 있다.

    - 오버로딩 조건
    1) 메서드 이름이 같아야함
    2) 매개변수의 개수 또는 타입이 달라야함
            ex) void tmp (int a, int b) {}
                void tmp (int c, int d) {}

    * 오버로딩 / 오버라이딩 구분법: 같은 클래스 안에 있으면 '오버로딩', 다른 클래스에 있으면 '오버라이딩'

 */

public class Ex16_1_오버로딩{
}
