package ch1;

public class Ex07_연산자 {
    public static void main(String[] args) {

    /*
        1) 산술 연산자 (+,-,*,/,%)
            % - 나머지. 반복수 뽑아낼때 사용

            0 % 3 = 0
            1 % 3 = 1
            2 % 3 = 2
            3 % 3 = 0
            4 % 3 = 1
            5 % 3 = 2
            6 % 3 = 0
            7 % 3 = 1
            8 % 3 = 2

        2) 비교 연산자: <,>, <=, >=, ==, ===, !=, !==
        3) 논리 연산자: &&, ||, !(not), ^(xor), ~(비트를 반전), &
        4) 대입 연산자: =
        5) 증감: ++, --
        6) 삼항연산자
            조건식?'참':'거짓'

            우선순위 : 사칙 > 비교 > 논리 > 대입 순으로 진행됨
     */


    }
}